package days29;

/**
 * @author kenik
 * @date 2022. 3. 30. - 오전 10:51:13
 * @subject  Chapter 13  스레드( Thread )
 * @content  p 722
 */
public class Ex03 {

	public static void main(String[] args) {
		// 11:03 수업시작~
		/*
		 * 1. 프로세스( process )
		 *     작업관리자 =
		 *      
		 *     OS(운영체제)로 부터    실행에 필요한 자원( 메모리, CPU, 전원, 디스크 )을 할당받아서
		 *     실행중인 프로그램을 프로세스 
		 *     
		 *     calc.exe 실행파일 -> 실행 -> 실행중인 프로그램  == 프로세스 1
		 *     calc.exe 실행파일 -> 실행 -> 실행중인 프로그램  == 프로세스 2
		 * 
		 * 2. 스레드( Thread )
		 *    - 프로세스 내에서 독립적으로  실행되는 메서드( 기능 )
		 *    - 최소한 기본 1개의 스레드 (   main 스레드   )
		 *    - 여러 개의 스레드( 멀티 스레드 )가 존재할 수 있다.
		 *    
		 * 3. 멀티 스레드과 멀티 태스킹
		 *    ㄴ 멀티 스레드 :    여러 개의  스레드           
		 *    ㄴ 멀티 태스킹 :   여러 개의  프로세스    
		 *    
		 *  4.   CPU =  시분할 멀티 태스킹... -- (자동) OS 관리
		 *        "OS" 자동 관리  -   멀티 태스킹 ( 멀리 스레드 )
		 *        개발자 스레드 처리 어렵다.
		 *        
		 *  5.  자바  스레드 사용하는 방법 ( 구현)
		 *       ㄱ.  Runnable 인터페이스를 사용
		 *       ㄴ.  Thread     클래스를 사용.    
		 * */
	   
	} // main

} // class












